{
  "AppSettings": {
    "SecretTokenKey": "Clave secreta no se comparte dsfsdfg sdsdgf dsgsdgsdgsdgs sdfdsf sdfsdfsdfsdf sdfsdfsdfsdd"
    //TODO: VER DE GENERAR ESTA CABLE AUTOMATICA
  },
  "EmpresaSettings": {
    "NombreEmpresa": "CoolTechUy",
    "DireccionEmpresa": "18 de julio 1240 local 5",
    "TelefonoEmpresa": "095461141",
    "PoliticasEmpresa": "Depósito de Equipos:Los equipos reparados que no sean reclamados por el cliente dentro de los 90 días posteriores a la notificación de que la reparación ha sido completada, serán trasladados a nuestro depósito. Si no se establece ningún contacto por parte del cliente en el mismo periodo, el equipo será considerado abandonado. Nos reservamos el derecho de disponer de dichos equipos a nuestra discreción.Aceptación de Presupuestos:Todo presupuesto emitido debe ser aceptado por el cliente en un plazo máximo de 1 día. La falta de aceptación dentro de este plazo puede resultar en variaciones en las fechas estimadas de entrega debido a la programación y disponibilidad de recursos.Variaciones en el Precio Final de la Reparación:El precio final de la reparación puede variar respecto al presupuesto inicial. Esto puede deberse a la detección de otros desperfectos o problemas adicionales durante el proceso de reparación. Cualquier variación en el precio será comunicada al cliente lo antes posible para su aprobación antes de proceder con la reparación adicional.Comunicación con el Cliente:Es responsabilidad del cliente mantener actualizados sus datos de contacto para facilitar una comunicación fluida. En caso de que no se pueda contactar al cliente a través de los medios proporcionados, no nos hacemos responsables por demoras o acciones tomadas debido a la falta de respuesta.",
    "Email": "pruebaemial.net@outlook.es",
    "EmailPassword": "vrmdmnpevavlssxx",
    "EmailServer": "smtp.office365.com"
  },


  "ConnectionStrings": {
    "ProyectoServiceContext": "Data Source=np:\\\\.\\pipe\\LOCALDB#A7C6CA8E\\tsql\\query;Initial Catalog=proyectoBD;Integrated Security=True"

    //Data Source=np:\\.\pipe\LOCALDB#A7C6CA8E\tsql\query;Initial Catalog=proyectoBD;Integrated Security=True
    //Data Source=(LocalDB)\MSSQLLocalDB;AttachDbFilename=C:\Users\Lucas\Desktop\PROYECTO INTEGRADOR\ProyectoServiceBackend\ProyectoServiceBackEnd\BD\bdProyecto.mdf;Integrated Security=True;Connect Timeout=30;Encrypt=True
  },
  "Logging": {
    "LogLevel": {
      "Default": "Information",
      "Microsoft.AspNetCore": "Warning"
    }
  },
  "AllowedHosts": "*"
}
